1yib.rust-bundle
aaron-bond.better-comments
adpyke.codesnap
aessoft.aessoft-class-autocomplete
alduncanson.react-hooks-snippets
alefragnani.bookmarks
alexcambose.time-tracker
aliariff.auto-add-brackets
andrepimenta.claude-code-chat
anthropic.claude-code
beaugunderson.solidity-extended
bibhasdn.git-easy
blackboxapp.blackbox
blackboxapp.blackboxagent
bladnman.auto-align
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
c0d30.solidity-audit-helper
cardinal90.multi-cursor-case-preserve
chakrounanas.turbo-console-log
christianrm.express-skeleton
compulim.compulim-vscode-closetag
conceptatech.claude-ai-code-review
dbaeumer.vscode-eslint
discountry.react-redux-react-router-snippets
dsznajder.es7-react-js-snippets
dustypomerleau.rust-syntax
eamodio.gitlens
ephoton.indent-switcher
exceptionptr.vscode-prettier-eslint
expresssnippets.vscode-express-snippets
extensions.json
feiskyer.chatgpt-copilot
felipecaputo.git-project-manager
firsttris.vscode-jest-runner
formulahendry.code-runner
fraser.live-coder
gazugafan.vscode-indent-on-paste
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gruntfuggly.align-mode
hb432.prettier-eslint-typescript
hosho.solidity-debugger
huizhou.githd
humao.rest-client
infeng.vscode-react-typescript
jebbs.plantuml
jeremyrajan.react-component
johnpapa.read-time
johnpapa.vscode-peacock
jrebocho.vscode-random
juanblanco.solidity
kevinkyang.auto-comment-blocks
kisstkondoros.vscode-gutter-preview
kodu-ai.claude-dev-experimental
lesgrieve.paste-indent
maratib.solidity-snippets
mblode.pretty-formatter
mccarter.start-git-bash
mcright.auto-save
mhutchie.git-graph
mikestead.dotenv
mnick.express-snippet
mongodb.mongodb-vscode
monish.regexsnippets
moppitz.vscode-extension-auto-import
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-cosmosdb
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.makefile-tools
ms-vscode.remote-repositories
ms-vsliveshare.vsliveshare
ms-windows-ai-studio.windows-ai-studio
naqvi.es7-react-snippets
naumovs.color-highlight
naveenn.claude-ai-assist
negokaz.live-server-preview
nguyenngoclong.terminal-keeper
nomicfoundation.hardhat-solidity
nucllear.vscode-extension-auto-import
ofhumanbondage.react-proptypes-intellisense
oouo-diogo-perdigao.docthis
orepor.color-tabs-vscode-ext
orta.vscode-jest
planbcoding.vscode-react-refactor
polymeilex.rust-targets
postman.postman-for-vscode
profimedica.live-preview
ritwickdey.liveserver
robertz.code-snapshot
rodrigovallades.es7-react-js-snippets
roerohan.mongo-snippets-for-node-js
rubymaniac.vscode-paste-and-indent
rust-lang.rust-analyzer
sandipchitale.vscode-indent-line
satoshiyamamoto.vscode-indent-space
shd101wyy.markdown-preview-enhanced
sidthesloth.html5-boilerplate
solnurkarim.html-to-css-autocompletion
sporiley.css-auto-prefix
starkware.cairo1
steoates.autoimport
sygene.auto-correct
tal7aouy.indent-colorizer
tamasfe.even-better-toml
teamsdevapp.vscode-ai-foundry
timothymclane.react-redux-es6-snippets
tintinweb.graphviz-interactive-preview
tintinweb.solidity-ai
tintinweb.solidity-visual-auditor
tintinweb.vscode-ethover
tintinweb.vscode-inline-bookmarks
tintinweb.vscode-solidity-flattener
tintinweb.vscode-solidity-language
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
vscodevim.vim
wakatime.vscode-wakatime
wallabyjs.console-ninja
wallabyjs.quokka-vscode
walter-ribeiro.full-react-snippets
wycliffepepela.live-postman
xabikos.reactsnippets
ysemeniuk.emmet-live
yuichinukiyama.vscode-preview-server
zignd.html-css-class-completion
zuoez02.tslint-snippets
